/****************************************************************************/
/* Localization file */

"IBAMainWindowToolbar.toolbarItem.focusHistoryNavigation.label" = "Focus History";
"IBAMainWindowToolbar.toolbarItem.focusedViewPath.label" = "Focused View Path";
"IBAMainWindowToolbar.toolbarItem.applicationChooser.label" = "Running Applications";
"IBAMainWindowToolbar.toolbarItem.refreshViewHierarchy.label" = "Refresh";
"IBAMainWindowToolbar.toolbarItem.refreshViewHierarchy.toolTip" = "Refresh";

"IBAMainMenu.autoLayout.show" = "Show Constraints and Guides";
"IBAMainMenu.autoLayout.hide" = "Hide Constraints and Guides";

"IBAAppDetailsInspectorViewController.inspectorSection.application.title" = "Application";
"IBAAppDetailsInspectorViewController.inspectorSection.application.statusBarGroup.title" = "Status Bar";

"IBAAppDetailsInspectorViewController.inspectorSection.device.title" = "Device";
"IBAAppDetailsInspectorViewController.inspectorSection.device.battery.title" = "Battery";
"IBAAppDetailsInspectorViewController.inspectorSection.device.proximity.title" = "Proximity";

"IBAInspectorDataDefaults.error.valueOutOfBounds.errorDescriptionFormat" = "%@ value “%@” is invalid.";
"IBAInspectorDataDefaults.error.valueOutOfBounds.recoverySuggestionFormat" = "Please provide a value between %@ and %@.";

"IBARevealDataService.error.preconditionFailed.failureReason.clientVersionGreaterThanServerVersion" = "The app is linked against an older version of the Reveal library. You may need to update the Reveal library in your app.";
"IBARevealDataService.error.preconditionFailed.failureReason.clientVersionLessThanServerVersion" = "The app is linked against a newer version of the Reveal library. You may need to upgrade Reveal.";
"IBARevealDataService.error.preconditionFailed.failureReason.unrecognizedPrecondition" = "Unrecognized pre-condition failure (%1$d, %2$d).";
"IBARevealDataService.error.preconditionFailed.recoveryOption.showRevealLibraryInFinder" = "Show Reveal Library in Finder...";
"IBARevealDataService.error.preconditionFailed.recoveryOption.showIntegrationGuide" = "Show Integration Guide...";
"IBARevealDataService.error.preconditionFailed.recoveryOption.checkForUpdates" = "Check for Updates...";
"IBARevealDataService.error.timedOut.recoverySuggestion" = "Check that the application is not paused in the debugger and try again.";
"IBARevealDataService.error.timedOut.recoveryOption.retry" = "Retry";

"IBARevealSnapshot.error.unsupportedFormat.failureReason" = "Document format is unsupported.";
"IBARevealSnapshot.error.unsupportedFormatVersion.failureReason" = "Document format version is unsupported.";
"IBARevealSnapshot.error.unsupportedFormatVersion.recoverySuggestion" = "Try opening this document in a newer version of Reveal.";
"IBARevealSnapshot.error.corruptedData.failureReason" = "Document contents are corrupted.";
"IBARevealSnapshot.error.documentIsEmpty.failureReason" = "Document is empty.";

"RevealDataModelJSON.error.invalidJSON.failureReason" = "JSON structure is invalid.";
"RevealDataModelJSON.error.unexpectedData.failureReason" = "Unexpected view hierarchy structure detected.";
"RevealDataModelJSON.error.inconsistentUpdate.failureReason" = "Inconsistent view hierarchy update detected.";

"IBAFontName.shortName.defaultValue" = "Regular";
"IBAFontFamily.systemFont.name.helvetica" = "Helvetica Neue Interface (System Font)";
"IBAFontFamily.systemFont.name.sftext" = "San Francisco Text (System Font)";
"IBAFontFamily.systemFont.name.sfdisplay" = "San Francisco Display (System Font)";
"IBAFontFamily.systemFont.name.sfcompacttext" = "San Francisco Compact Text (System Font)";
"IBAFontFamily.systemFont.name.sfcompactdisplay" = "San Francisco Compact Display (System Font)";

"IBAApplicationIsDamagedAlert.messageText" = "This copy of Reveal is damaged";
"IBAApplicationIsDamagedAlert.informativeText" = "You should move this copy of Reveal to the trash and download a fresh copy.";
"IBAApplicationIsDamagedAlert.visitSiteButtonTitle" = "Visit Site";
"IBAApplicationIsDamagedAlert.quitButtonTitle" = "Quit";

"IBAConfirmLicenseDeactivationAlert.messageText" = "Deactivate license?";
"IBAConfirmLicenseDeactivationAlert.informativeText" = "Do you really wish to deactivate and remove the license from this computer? This will cause Reveal to quit immediately.";
"IBAConfirmLicenseDeactivationAlert.cancelButtonTitle" = "Cancel";
"IBAConfirmLicenseDeactivationAlert.confirmButtonTitle" = "Deactivate & Quit";

"IBARegistrationPreferencesError.unableToCloseAllDocuments.failureReason" = "Unable to close all open documents.";
"IBARegistrationPreferencesError.unableToCloseAllDocuments.recoverySuggestion" = "Please close all document windows manually.";
"IBARegistrationPreferencesError.deactivationFailed.failureReason" = "Deactivating license failed.";
"IBARegistrationPreferencesError.deactivationFailed.recoverySuggestion" = "Please ensure you have an active Internet connection.";

"IBARevealLicenseError.attemptToOpenReveal1License.errorDescription" = "The provided license is valid for versions up to 1.6.3. You are running version %1$@.";
"IBARevealLicenseError.attemptToOpenReveal1License.recoverySuggestion" = "Reveal has moved to a new licensing mechanism. In order to activate this version, you need a new license.";
"IBARevealLicenseError.attemptToOpenReveal1License.recoverySuggestion.buyNewLicense" = "Buy New License...";
"IBARevealLicenseError.attemptToOpenReveal1License.recoverySuggestion.moreInformation" = "More Info...";
"IBARevealLicenseError.attemptToOpenReveal1License.recoverySuggestion.cancel" = "Cancel";

"IBALLDBIntegrationService.Error.invalidFileEncoding" = "File contents could not be processed because of invalid encoding.";
"IBALLDBScriptIntegrator.Error.commandNotFound" = "Script integration command was not found in file contents.";

"IBADebuggerSupportAlerts.install.message" = "Install Debugger Commands";
"IBADebuggerSupportAlerts.install.informativeText" = "This process will create or modify the contents of .lldbinit file in your home directory.";
"IBADebuggerSupportAlerts.install.successMessage" = "Installation Complete";
"IBADebuggerSupportAlerts.install.successText" = "Reveal debugger commands are now installed. Information about using them is available in the Integration Guide.";
"IBADebuggerSupportAlerts.install.errorMessage" = "Installation Failed";

"IBADebuggerSupportAlerts.remove.message" = "Remove Debugger Commands";
"IBADebuggerSupportAlerts.remove.informativeText" = "This process will modify the contents of .lldbinit file in your home directory.";
"IBADebuggerSupportAlerts.remove.successMessage" = "Removal Complete";
"IBADebuggerSupportAlerts.remove.successText" = "Reveal debugger commands have been removed. You can install them again using the Help menu.";
"IBADebuggerSupportAlerts.remove.errorMessage" = "Removal Failed";

"IBADebuggerSupportAlerts.repair.message" = "Repair Debugger Commands";
"IBADebuggerSupportAlerts.repair.informativeText" = "Reveal has detected a previous installation of debugger commands that isn't linked to the currently running app.\n\nWould you like to repair this? The process will modify the contents of .lldbinit file in your home directory.";
"IBADebuggerSupportAlerts.repair.errorMessage" = "Repair Failed";
"IBADebuggerSupportAlerts.repair.action" = "Repair";
"IBADebuggerSupportAlerts.repair.notNow" = "Not Now";

"IBADebuggerSupportAlerts.continue" = "Continue";
"IBADebuggerSupportAlerts.cancel" = "Cancel";
"IBADebuggerSupportAlerts.done" = "Done";
"IBADebuggerSupportAlerts.integrationGuide" = "Open Integration Guide";

"IBASimulatorLaunchDescription.SampleError.soundstagramMissing.description" = "Soundstagram is missing.";

"IBAViewHierarchyNodeFilterOptionsDefault.menu.label" = "Default";
"IBAViewHierarchyNodeFilterOptionsDisplayTitle.menu.label" = "Label";
"IBAViewHierarchyNodeFilterOptionsClasses.menu.label" = "Class Name";
"IBAViewHierarchyNodeFilterOptionsClassName.menu.label" = "Class Name";
"IBAViewHierarchyNodeFilterOptionsSuperClassName.menu.label" = "Superclass Name";
"IBAViewHierarchyNodeFilterOptionsAccessibility.menu.label" = "Accessibility";
"IBAViewHierarchyNodeFilterOptionsAccessibilityLabel.menu.label" = "Accessibility Label";
"IBAViewHierarchyNodeFilterOptionsAccessibilityValue.menu.label" = "Accessibility Value";
"IBAViewHierarchyNodeFilterOptionsAccessibilityIdentifier.menu.label" = "Accessibility Identifier";
"IBAViewHierarchyNodeFilterOptionsAccessibilityHint.menu.label" = "Accessibility Hint";
"IBAViewHierarchyNodeFilterOptionsIdentifiers.menu.label" = "Identifier";
"IBAViewHierarchyNodeFilterOptionsIdentifier.menu.label" = "Identifier";
"IBAViewHierarchyNodeFilterOptionsRestorationIdentifier.menu.label" = "Restoration Identifier";
"IBAViewHierarchyNodeFilterOptionsViewTag.menu.label" = "View Tag";
"IBAViewHierarchyNodeFilterOptionsObjectAddress.menu.label" = "Memory Address";
"IBAViewHierarchyNodeFilterOptionsLayerName.menu.label" = "Layer Name";

"IBAViewHierarchyNodeFilterOptionsDisplayTitle.outline.label" = "Label";
"IBAViewHierarchyNodeFilterOptionsClasses.outline.label" = "Class";
"IBAViewHierarchyNodeFilterOptionsClassName.outline.label" = "Class";
"IBAViewHierarchyNodeFilterOptionsSuperClassName.outline.label" = "Superclass";
"IBAViewHierarchyNodeFilterOptionsAccessibility.outline.label" = "Accessibility";
"IBAViewHierarchyNodeFilterOptionsAccessibilityLabel.outline.label" = "Accessibility Label";
"IBAViewHierarchyNodeFilterOptionsAccessibilityValue.outline.label" = "Accessibility Value";
"IBAViewHierarchyNodeFilterOptionsAccessibilityIdentifier.outline.label" = "Accessibility Identifier";
"IBAViewHierarchyNodeFilterOptionsAccessibilityHint.outline.label" = "Accessibility Hint";
"IBAViewHierarchyNodeFilterOptionsIdentifiers.outline.label" = "Identifier";
"IBAViewHierarchyNodeFilterOptionsIdentifier.outline.label" = "Identifier";
"IBAViewHierarchyNodeFilterOptionsRestorationIdentifier.outline.label" = "Restoration Identifier";
"IBAViewHierarchyNodeFilterOptionsViewTag.outline.label" = "View Tag";
"IBAViewHierarchyNodeFilterOptionsObjectAddress.outline.label" = "Memory Address";
"IBAViewHierarchyNodeFilterOptionsLayerName.outline.label" = "Name";

"FilterResult.SourceObject.viewBackingLayer.outline.labelPrefix" = "Layer ";

"IBALayoutAmbiguityStatus.format.generic" = "Layout is ambiguous.";
"IBALayoutAmbiguityStatus.formatting.separatorOnly" = " and ";
"IBALayoutAmbiguityStatus.formatting.separatorManyNonLast" = ", ";
"IBALayoutAmbiguityStatus.formatting.separatorManyLast" = ", and ";
"IBALayoutAmbiguityStatus.component.position" = "position";
"IBALayoutAmbiguityStatus.component.positionHorizontal" = "horizontal position";
"IBALayoutAmbiguityStatus.component.positionVertical" = "vertical position";
"IBALayoutAmbiguityStatus.component.size" = "size";
"IBALayoutAmbiguityStatus.component.sizeHorizontal" = "width";
"IBALayoutAmbiguityStatus.component.sizeVertical" = "height";
"IBALayoutAmbiguityStatus.component.scrollingSize" = "scrollable content size";
"IBALayoutAmbiguityStatus.component.scrollingSizeHorizontal" = "scrollable content width";
"IBALayoutAmbiguityStatus.component.scrollingSizeVertical" = "scrollable content height";

"IBABrokenConstraint.analysisDescriptionBrokenLegacy" = "This constraint has been broken as the layout could not be satisfied.";
"IBABrokenConstraint.analysisDescriptionBrokenRecovered" = "This constraint has previously been broken as the layout could not be satisfied, but has since recovered.";

"InspectorScopeKind.view.title" = "View";
"InspectorScopeKind.layer.title" = "Layer";
"InspectorScopeKind.layoutConstraint.title" = "Constraint";
"InspectorScopeKind.layoutGuide.title" = "Guide";
"InspectorScopeKind.gestureRecognizer.title" = "Recognizer";
"InspectorScopeKind.screen.title" = "Screen";
"InspectorScopeKind.unknown.title" = "Object";

"InspectorScopeViewController.segment.tooltipFormat" = "Show %@ inspectors";

"DocumentWindowController.touchBar.focusFilterField.customizationLabel" = "Filter Items";
"DocumentWindowController.touchBar.autoLayoutVisibility.customizationLabel" = "Toggle Constraints and Guides";
"DocumentWindowController.touchBar.excludedItemsVisibility.customizationLabel" = "Toggle System Windows and Views";
"DocumentWindowController.touchBar.hiddenItemsVisibility.customizationLabel" = "Toggle Hidden Items";
"DocumentWindowController.touchBar.canvasZoomSlider.label" = "Zoom";
"DocumentWindowController.touchBar.canvasZoomSlider.customizationLabel" = "Zoom Level";
"DocumentWindowController.touchBar.resetView.customizationLabel" = "Reset View";
"DocumentWindowController.touchBar.perspective.customizationLabel" = "Perspective";
"DocumentWindowController.touchBar.renderMode.customizationLabel" = "Render Mode";
"DocumentWindowController.touchBar.refreshDocument.customizationLabel" = "Refresh";

"FilterFieldViewController.touchBar.filterOptionsPopover.customizationLabel" = "Filter By:";
"FilterFieldViewController.touchBar.filterOptionsLabel.customizationLabel" = "Filter By:";

"AnnualSupportApplicationBuildTooNewWelcomeStepController.title" = "Your license isn’t valid for this version";
"AnnualSupportApplicationBuildTooNewWelcomeStepController.description" = "Your license expired on %1$@. This version of %2$@ was released after that date.";

"WelcomeStepController.activate.title" = "Already renewed your license?";
"WelcomeStepController.activate.message" = "Thanks for your support!";
"WelcomeStepController.activate.button.title" = "Activate %1$@";

"AnnualSupportApplicationBuildTooNewWelcomeStepController.cancelButton.title" = "Quit";

"AnnualSupportApplicationBuildTooNewWelcomeStepController.renew.title" = "Renew your license";
"AnnualSupportApplicationBuildTooNewWelcomeStepController.renew.message" = "Get another year of great features and updates.";
"AnnualSupportApplicationBuildTooNewWelcomeStepController.renew.button.title" = "Renew License";

"AnnualSupportApplicationBuildTooNewWelcomeStepController.downloadOldVersion.title" = "You can use an older version";
"AnnualSupportApplicationBuildTooNewWelcomeStepController.downloadOldVersion.message" = "Download and use a previous version of %1$@.";
"AnnualSupportApplicationBuildTooNewWelcomeStepController.downloadOldVersion.button.title" = "Download Previous Version";

"DMKevlarError.keyAlreadyActivated.description" = "There are no activations left for this number. Please deactivate this number on one of your other computers, or reset the activations using the button below.";

"AnnualSupportStatusWelcomeStepController.continueUsing.title" = "Keep using this version";
"AnnualSupportStatusWelcomeStepController.continueUsing.message" = "You can keep using this version of %1$@ forever.";
"AnnualSupportStatusWelcomeStepController.continueUsing.button.title" = "Use this version";

"AnnualSupportStatusWelcomeStepController.renew.title" = "Renew your license";
"AnnualSupportStatusWelcomeStepController.renew.message" = "Get another year of great features and updates.";
"AnnualSupportStatusWelcomeStepController.renew.button.title" = "Renew License";

